<?php

interface DatabaseInterface{

    /**
     * Καταχώρηση Χρήστη στην Βάση Δεδομένων
     */
    public static function registerNewUser($fullName,$email,$username,$password);
    
    /**Προβολή Λίστας Εργασιών: */
    function showAllTaskLists();

    function showTaskLists($user_id);

    /**Επεξεργασία Λίστας Εργασιών: θα υπάρχει η δυνατότητα επεξεργασίας των στοιχείων της
     * λίστας εργασιών, καθώς και η διαγραφή της. Ενδεικτικά, μπορεί να υπάρχουν αντίστοιχα
     * κουμπιά δίπλα από τον τίτλο της. */
    function deleteTaskList($task_list_id);
    function updateTaskList($task_list_id,$newState,$newCategory);
    /**Προβολή Εργασιών: κάτω από τα στοιχεία κάθε λίστας εργασιών θα εμφανίζονται οι
     * αντίστοιχες εργασίες της με αλφαβητική σειρά. */
    function showTasksPerList();
    /**Διαγραφή Εργασίας: θα είναι δυνατή μόνο η διαγραφή μίας εργασίας (δεν απαιτείται
     * λειτουργία επεξεργασία της), ενδεικτικά μπορεί να υπάρχει ένα αντίστοιχο κουμπί δίπλα
     * στον τίτλο μίας εργασίας.
     * Προσθήκη Εργασίας: θα είναι δυνατή η προσθήκη μίας εργασίας σε μία λίστα εργασιών με
     * την ύπαρξη σχετικού κουμπιού κάτω από την τελευταία εργασία. */
    function deleteTask($task_id);
    function createTask($task_title);
    function addTask($task_list_id,$task_title);
    function showTasks();
    /**Δημιουργία Λίστας Εργασιών: θα είναι δυνατή η προσθήκη μίας νέας λίστας εργασιών,
     * όπου στη φόρμα αρκεί να δηλώνεται ο τίτλος της λίστας εργασιών και η κατηγορία της,
     * καθώς η κατάστασή της θα είναι προκαθορισμένη ως «Νέα». Ενδεικτικά, αυτή η
     * δυνατότητα/φόρμα μπορεί να είναι διαθέσιμη στο κάτω μέρος της σελίδας, όπως
     * αναπαρίσταται στην 2η ΓΕ */
    function createTaskList($title,$category,$state,$user_id);


    /**Προβολή Ομάδων: θα εμφανίζονται όλες οι ομάδες, η μία κάτω από την άλλη. Για κάθε
     * ομάδα θα εμφανίζεται το όνομά της και τα μέλη της (username).
     * - Προσθήκη Μελών: θα υπάρχει η δυνατότητα προσθήκης ενός μέλους σε μία ομάδα.
     * Σημείωση: μόνο ήδη εγγεγραμμένοι χρήστες μπορούν να γίνουν μέλη σε μία ομάδα.
     * - Ανάθεση Λίστας Εργασιών: θα υπάρχει η δυνατότητα ανάθεσης μίας υπάρχουσας λίστας
     * εργασιών σε ένα μέλος της ομάδας. Σημείωση: για λόγους ευκολίας στο πλαίσιο της
     * άσκησης, ο διαχειριστής θα μπορεί να επιλέγει να αναθέσει μία υπάρχουσα λίστα εργασιών
     * από αυτές που έχει δημιουργήσει ο ίδιος από τη σελίδα «Λίστα Εργασιών». Η ίδια λίστα
     * εργασιών μπορεί να ανατεθεί σε περισσότερα από ένα μέλη μίας ομάδας.
     * - Δημιουργία Ομάδας: θα είναι η δυνατή η προσθήκη μίας νέας ομάδας λίστας εργασιών,
     * όπου στη φόρμα αρκεί να δηλώνεται το όνομα της ομάδας. Ενδεικτικά αυτή η
     * δυνατότητα/φόρμα μπορεί να είναι διαθέσιμη στο κάτω μέρος της σελίδας, όπως
     * αναπαρίσταται στην 2η ΓΕ. */
    function showTeams();
    function showUsers();
    function addMemberToTeam($team_id,$user_id);
    function delegateTaskListToUser($task_list_id,$user_id);
    function createTeam($teamName);
    function showUserIdRole($username);
    function showUsernames();
    function isCredentialsCorrect($username,$password);
    function showMemberPerTeam();
    function taskListMember();
}